In [1]:
import pandas as pd

In [2]:
data={'Students':['Amit','Anam','Chi','Sam','Ravi','Jai'],
    'Marks':[85,None,65,75,None,55]}

In [3]:
df=pd.DataFrame(data)
df

  Students  Marks
0     Amit   85.0
1     Anam    NaN
2      Chi   65.0
3      Sam   75.0
4     Ravi    NaN
5      Jai   55.0

In [4]:
print('Missing Data')
print('Number of missing values are:',df.isnull().sum())

Missing Data
Number of missing values are: Students    0
Marks       2
dtype: int64

In [6]:
average_marks=df['Marks'].mean()
print(average_marks)

70.0

In [7]:
df.fillna(average_marks, inplace=True)

In [8]:
print('after fillna() call')
df

after fillna() call

  Students  Marks
0     Amit   85.0
1     Anam   70.0
2      Chi   65.0
3      Sam   75.0
4     Ravi   70.0
5      Jai   55.0

## Let us see it, how we will use in our project

In [11]:
#fillna() example
students_data={'Name':['Amit','Anam','Chi','Sam','Ravi','Jai'],
    'Marks':[85,None,65,75,None,55]}
df=pd.DataFrame(students_data)

df

   Name  Marks
0  Amit   85.0
1  Anam    NaN
2   Chi   65.0
3   Sam   75.0
4  Ravi    NaN
5   Jai   55.0

In [12]:
df.fillna(df['Marks'].mean(), inplace=True)

In [13]:
df

   Name  Marks
0  Amit   85.0
1  Anam   70.0
2   Chi   65.0
3   Sam   75.0
4  Ravi   70.0
5   Jai   55.0

# dropna() example

In [14]:
students_data={'Name':['Amit','Anam','Chi','Sam','Ravi','Jai'],
    'Marks':[85,None,65,75,None,55]}
df=pd.DataFrame(students_data)
print('Original Data')
df

Original Data

   Name  Marks
0  Amit   85.0
1  Anam    NaN
2   Chi   65.0
3   Sam   75.0
4  Ravi    NaN
5   Jai   55.0

In [16]:
df=df.dropna(subset=['Marks'])

In [17]:
print('Dataset after dropna()')
df

Dataset after dropna()

   Name  Marks
0  Amit   85.0
2   Chi   65.0
3   Sam   75.0
5   Jai   55.0

In [18]:
students_data={'Name':['Amit','Anam','Chi','Sam','Ravi','Jai'],
    'Marks':[85,None,65,75,None,55]}
df=pd.DataFrame(students_data)
print('Original Data')

Original Data

In [19]:
df
df=df.dropna()
print('Dataset afetr dropna()')

Dataset afetr dropna()

In [22]:
emp_data={
    "Name":['Sam','Ali','Chang','Xi','Viz','Suhail'],
     "Age":[35,40,25,20,24,40],
    "Salary":[50000,40000,50000,40000,None,None],
    }
df=pd.DataFrame(emp_data)
print('Original Data')
df

Original Data

     Name  Age   Salary
0     Sam   35  50000.0
1     Ali   40  40000.0
2   Chang   25  50000.0
3      Xi   20  40000.0
4     Viz   24      NaN
5  Suhail   40      NaN

In [23]:
print(df.isnull().sum())

Name      0
Age       0
Salary    2
dtype: int64

In [24]:
df_drop=df.dropna()
df_drop

    Name  Age   Salary
0    Sam   35  50000.0
1    Ali   40  40000.0
2  Chang   25  50000.0
3     Xi   20  40000.0

In [25]:
df_drop_salary=df.dropna(subset=['Salary'])
df_drop_salary

    Name  Age   Salary
0    Sam   35  50000.0
1    Ali   40  40000.0
2  Chang   25  50000.0
3     Xi   20  40000.0

In [29]:
df

     Name  Age   Salary
0     Sam   35  50000.0
1     Ali   40  40000.0
2   Chang   25  50000.0
3      Xi   20  40000.0
4     Viz   24  45000.0
5  Suhail   40  45000.0

In [30]:

#fillna example
print(df)

     Name  Age   Salary
0     Sam   35  50000.0
1     Ali   40  40000.0
2   Chang   25  50000.0
3      Xi   20  40000.0
4     Viz   24  45000.0
5  Suhail   40  45000.0

In [31]:
emp_data={
    "Name":['Sam','Ali','Chang','Xi','Viz','Suhail'],
    "Age":[35,None,25,20,24,None],
    "Salary":[50000,30000,20000,40000,None,None],
    }
df=pd.DataFrame(emp_data)
print('Original Data')
df

Original Data

     Name   Age   Salary
0     Sam  35.0  50000.0
1     Ali   NaN  30000.0
2   Chang  25.0  20000.0
3      Xi  20.0  40000.0
4     Viz  24.0      NaN
5  Suhail   NaN      NaN

In [32]:
df

     Name   Age   Salary
0     Sam  35.0  50000.0
1     Ali   NaN  30000.0
2   Chang  25.0  20000.0
3      Xi  20.0  40000.0
4     Viz  24.0      NaN
5  Suhail   NaN      NaN

In [33]:
 df.fillna({'Age':df['Age'].mean(),'Salary':df['Salary'].mean()}, inplace=True)

In [34]:
df

     Name   Age   Salary
0     Sam  35.0  50000.0
1     Ali  26.0  30000.0
2   Chang  25.0  20000.0
3      Xi  20.0  40000.0
4     Viz  24.0  35000.0
5  Suhail  26.0  35000.0

In [35]:
emp_data={
    "Name":['Sam','Ali','Chang','Xi','Viz','Suhail'],
     "Age":[35,40,25,20,24,40],
    "Salary":[50000,40000,50000,40000,None,None],
    }
df=pd.DataFrame(emp_data)
df.fillna({'Age':df['Age'].mean(),'Salary':df['Salary'].mean()}, inplace=True)
df

     Name  Age   Salary
0     Sam   35  50000.0
1     Ali   40  40000.0
2   Chang   25  50000.0
3      Xi   20  40000.0
4     Viz   24  45000.0
5  Suhail   40  45000.0

## download students_performance_dirty.csv
## find out number of missing data
## drop rows where gender is missing
## fill study_hours with average study_hours

In [36]:
import pandas as pd

In [37]:
df = pd.read_csv('students_performance_dirty.csv')

In [38]:
print("Number of missing values in each column:")
print(df.isnull().sum())  # or df.isna().sum()

Number of missing values in each column:
gender            8
study_hours       8
attendance_pct    0
math_score        0
reading_score     0
final_score       0
dtype: int64

In [42]:
df = df.dropna(subset=['gender'])

In [44]:
# 4️⃣ Fill missing 'study_hours' with the average (mean) # ---> option 1
mean_study_hours = df['study_hours'].mean()
df['study_hours'] = df['study_hours'].fillna(mean_study_hours)

In [45]:
df.fillna({'study_hours':df['study_hours'].mean()}, inplace=True) # ----> option 2

In [41]:
# 5️⃣ Check result
print("\nAfter cleaning:")
print(df.isnull().sum())

After cleaning:
gender            0
study_hours       0
attendance_pct    0
math_score        0
reading_score     0
final_score       0
dtype: int64